app/Models/ModelCatatan.php

SELECT *
FROM `tbl_catatan`
---
    public function AllData()
    {
        return $this->db->table('tbl_catatan')
            ->get()->getResultArray();

SELECT *
FROM `tbl_catatan`
LEFT JOIN `tbl_user` ON `tbl_user`.`id_user`=`tbl_catatan`.`id_user`
LEFT JOIN `tbl_toko` ON `tbl_toko`.`id_toko`=`tbl_catatan`.`id_toko`
---
    public function JoinForAll()
    {
        return $this->db->table('tbl_catatan')
            ->join('tbl_user', 'tbl_user.id_user=tbl_catatan.id_user', 'LEFT')
            ->join('tbl_toko', 'tbl_toko.id_toko=tbl_catatan.id_toko', 'LEFT')
            ->get()->getResultArray();