app/Models/ModelUser.php

SELECT *
FROM `tbl_user`
---
    public function AllData()
    {
        return $this->db->table('tbl_user')
            ->get()->getResultArray();

SELECT *
FROM `tbl_user`
LEFT JOIN `tbl_role` ON `tbl_role`.`id_role`=`tbl_user`.`id_role`
WHERE `id_user` = '2'
---
    public function DetailData($id_user)
    {
        return $this->db->table('tbl_user')
            ->join('tbl_role', 'tbl_role.id_role=tbl_user.id_role', 'LEFT')
            ->where('id_user', $id_user)
            ->get()->getRowArray();

SELECT *
FROM `tbl_user`
LEFT JOIN `tbl_role` ON `tbl_role`.`id_role`=`tbl_user`.`id_role`
---
    public function JoinUserRole()
    {
        return $this->db->table('tbl_user')
            ->join('tbl_role', 'tbl_role.id_role=tbl_user.id_role', 'LEFT')
            ->get()->getResultArray();

UPDATE `tbl_user` SET `id_user` = '2', `username` = 'admin', `email` = 'admin@gmail.com', `password` = '7b2e9f54cdff413fcde01f330af6896c3cd7e6cd', `id_role` = '2', `foto` = '1688565151_b362539d050b7b320387.jpg'
WHERE `id_user` = '2'
---
    public function UpdateData($data)
    {
        $this->db->table('tbl_user')
            ->where('id_user', $data['id_user'])
            ->update($data);

SELECT *
FROM `tbl_role`
---
    public function allRole()
    {
        return $this->db->table('tbl_role')
            ->get()->getResultArray();