app/Models/ModelToko.php

    public function AllData()
    {
        return $this->db->table('tbl_toko')
            ->get()->getResultArray();
---
SELECT *
FROM `tbl_toko`

    public function JoinForALl()
    {
        return $this->db->table('tbl_toko')
            ->join('tbl_provinsi', 'tbl_provinsi.id_provinsi=tbl_toko.id_provinsi', 'LEFT')
            ->join('tbl_kabupaten', 'tbl_kabupaten.id_kabupaten=tbl_toko.id_kabupaten', 'LEFT')
            ->join('tbl_kecamatan', 'tbl_kecamatan.id_kecamatan=tbl_toko.id_kecamatan', 'LEFT')
            ->join('tbl_wilayah', 'tbl_wilayah.id_wilayah=tbl_toko.id_wilayah', 'LEFT')
            ->get()->getResultArray();
---
SELECT *
FROM `tbl_toko`
LEFT JOIN `tbl_provinsi` ON `tbl_provinsi`.`id_provinsi`=`tbl_toko`.`id_provinsi`
LEFT JOIN `tbl_kabupaten` ON `tbl_kabupaten`.`id_kabupaten`=`tbl_toko`.`id_kabupaten`
LEFT JOIN `tbl_kecamatan` ON `tbl_kecamatan`.`id_kecamatan`=`tbl_toko`.`id_kecamatan`
LEFT JOIN `tbl_wilayah` ON `tbl_wilayah`.`id_wilayah`=`tbl_toko`.`id_wilayah`