app/Models/ModelPengaturan.php

SELECT *
FROM `tbl_pengaturan`
LEFT JOIN `tbl_kabupaten` ON `tbl_kabupaten`.`id_kabupaten`=`tbl_pengaturan`.`id_kabupaten`
WHERE `id` = 1
---
    public function DataWeb()
    {
        return $this->db->table('tbl_pengaturan')
            ->join('tbl_kabupaten', 'tbl_kabupaten.id_kabupaten=tbl_pengaturan.id_kabupaten', 'LEFT')
            ->where('id', 1)
            ->get()->getRowArray();

SELECT *
FROM `tbl_provinsi`
ORDER BY `id_provinsi` ASC
---
    public function allProvinsi()
    {
        return $this->db->table('tbl_provinsi')
            ->orderBy('id_provinsi', 'ASC')
            ->get()->getResultArray();