app/Models/ModelWilayah.php

    public function AllData()
    {
        return $this->db->table('tbl_wilayah')
            ->get()->getResultArray();
---
SELECT *
FROM `tbl_wilayah`